---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DpartPhaseDemolishedByOriginal
source: html/b05d5fad-4273-97db-1dc3-e3775391d42b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DpartPhaseDemolishedByOriginal Property

"Phase Demolished By Original"

## Syntax (C#)
```csharp
public static ForgeTypeId DpartPhaseDemolishedByOriginal { get; }
```